<div>
  <h2>Introduction &agrave; la programmation fonctionelle au travers de Scala</h2>

  <h3><i>Pourquoi ce buzz... en dehors des amphis ?</i></h3>
    <p>
	 <a title="C'est gratuit!" href="http://wajug.fikket.com/events/introduction-a-la-programmation-fonctionelle-au-travers-de-scala-par-andy-petrella/orders/new">
	<button class=" btn btn-primary btn-block btn-mini" style="max-height: 30px;max-width: 80px;">
	  R&eacute;servez <i class="icon-shopping-cart icon-white"></i>
	</button> 
    </a>
  </p>
  <p>Dans cette pr&eacute;sentation, nous allons survoler les concepts fondamentaux de la programmation fonctionnelle,
	les expressions, immutabilit&eacute; et consors. A des fins d&rsquo;illustrations, nous programmerons cela en live en utilisant Scala.</p>
  <p>Gr&acirc;ce &agrave; cette petite introduction, nous aurons d&eacute;j&agrave; assez d&rsquo;informations pour saisir
	les subtilit&eacute;s garantissant cette qualit&eacute; dans le monde de la programmation concurrente
	-- pi&egrave;ce ma&icirc;tresse de toute application cloud. Une des libraries les plus populaires
	prenant avantages de ces fonctionnalit&eacute;s glonfl&eacute;es en mati&egrave;re de concurrence est Akka.</p>
  <p>Mets tout &ccedil;a dans un serveur web et tu obtiens un genre de Nirvana non-bloquant et
	hautement r&eacute;actif -- optimisant la consommation des ressources et capable de monter en charge.
	En toute logique avec ce qui pr&eacute;c&egrave;de, un d&eacute;monstration du Play! Framework 2 s&rsquo;impose.</p>

  <h2>A propos d&#x27;Andy</h2>

	<p>Avant mon mariage et un super gosse (mes plus grandes fiertés), j'ai étudié les Mathématiques à l'Univeristé de Liège, directement suivi par une autre licence en Informatique.</p>
	<p>Après mon devoir scolaire, j'ai principalement travaillé dans le monde SIG (GIS), ou j'ai eu l'occasion de participer à des projets géniaux avec des parties prenantes telles que OTAN ou encore l'ESA -- pendant lesquels je me suis bien amusé avec du Java, Python, AS3, JavaScript et autres broles du style.</p>
	<p>Et maintenant, dans la société NextLab que j'ai cofondé... je me poile en hackant du Scala et de la programmation fonctionnelle en général... Ppour le web, je le fais à travers la lentille lay! Framework 2. Ah oui, je suis aussi en train d'écrire un bouquin... sur Play! Framework 2.</p>

	<h2>O&ugrave; &amp; Quand</h2>
	<p>Jeudi 17 janvier 2013<br/>
		Li&egrave;ge ou aux alentours, l&#x27;emplacement exact vous sera communiqu&eacute; ult&eacute;rieurement.<br/>
		<i>Nous sommes toujours &agrave; la recherche d&#x27;une salle de r&eacute;union. Si vous souhaitez nous accueillir au sein de votre entreprise, n&#x27;h&eacute;sitez pas &agrave; nous contacter: <a href="mailto:info@wajug.be">info@wajug.be</a></i>
		</p>
    <p>
	 <a title="C'est gratuit!" href="http://wajug.fikket.com/events/introduction-a-la-programmation-fonctionelle-au-travers-de-scala-par-andy-petrella/orders/new">
	<button class=" btn btn-primary btn-block btn-mini" style="max-height: 30px;max-width: 80px;">
	  R&eacute;servez <i class="icon-shopping-cart icon-white"></i>
	</button> 
    </a>
  </p>
		
</div>